package module.first;

public class LinearPrograms {
    public static void main(String[] args) {
//1. Найдите  значение функции: z = ( (a – 3 ) * b / 2) + c.
//2. Вычислить значение выражения по формуле (все переменные принимают действительные значения):
//3. Вычислить значение выражения по формуле (все переменные принимают действительные значения):
//4. Дано действительное число R вида nnn.ddd (три цифровых разряда в дробной и целой частях). Поменять местами дробную и целую части числа и вывести полученное значение числа.
//5. Дано натуральное число Т, которое представляет длительность прошедшего времени в секундах. Вывести данное значение длительности в часах, минутах и секундах в следующей форме:
//6. Для данной области составить линейную программу, которая печатает true, если точка с координатами (х, у) принадлежит закрашенной области, и false — в противном случае:
    }

}
